from selenium.common.exceptions import TimeoutException
from selenium import webdriver
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.common.by import By
from selenium.webdriver.chrome.service import Service
from webdriver_manager.chrome import ChromeDriverManager # type: ignore
import time
from typing import *

def get_driver():
    options = webdriver.ChromeOptions()
    options.add_argument("--disable-blink-features=AutomationControlled")
    options.add_argument("--headless")  # 無頭模式
    options.add_argument("--no-sandbox")  # 解決無特權 Docker 容器的問題
    options.add_argument("--disable-dev-shm-usage")  # 解決共享內存不足問題
    options.add_argument("--disable-gpu")  # 禁用 GPU
    options.add_argument("--remote-debugging-port=9222")  # 遠端調試端口
    options.add_argument("user-agent=Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/52.0.2743.116 Safari/537.36")
    options.add_argument("--log-level=1")    
    service = Service(ChromeDriverManager().install())
    driver = webdriver.Chrome(service=service, options=options)
    return driver

def get_string(driver:webdriver.Chrome, url:str, audioPath:str):
    driver.get(url)
    string = ""
    state = False

    try:
        # 等網頁載好
        try:
            WebDriverWait(driver, 20).until(EC.presence_of_element_located((By.ID, 'component-62')))
        except TimeoutException:
            return "時間過長", state
        time.sleep(0.2)

        # 換輸入音檔
        switchAudioFile = driver.find_element(By.ID, 'component-63-button')
        switchAudioFile.click()
        time.sleep(0.2)

        # 輸入音檔後輸出
        div = driver.find_element(By.ID, "component-19")
        fileInput = div.find_element(By.TAG_NAME, "input")
        submitBtn = driver.find_element(By.ID, "component-33")
        timestampsCheck = driver.find_element(By.ID, "component-21")
        fileInput.send_keys(audioPath)
        timestampsCheck.click()
        submitBtn.click()

        # 等到 textarea 處理好
        transcriptionDiv = driver.find_element(By.ID, "component-22")
        textarea = transcriptionDiv.find_element(By.TAG_NAME, "textarea")
        errorDiv = driver.find_element(By.CLASS_NAME, "toast-wrap")
        while len(textarea.get_attribute("value")) <= 24:
            if errorDiv.find_elements(By.TAG_NAME, "div"):
                return "太多人轉錄ㄌ", False
            time.sleep(2)

        state = True
        string = textarea.get_attribute('value')
        
    finally:
        driver.quit()

    return string, state


def getResult(audioPath, url='https://sanchit-gandhi-whisper-jax.hf.space') -> list[dict]:
    # driver = get_driver()
    # string, state = get_string(driver, url, audioPath)
    # if state == False:
    #     return [{"start":0, "end":0, "line":f"error: {string}"}]

    string = '''
        [00:00.000 -> 00:00.120] ん
        [00:00.120 -> 00:08.840] こんにちは さっき初めてのポッドキャストを撮ったんですが
        [00:08.840 -> 00:14.600] オノマトペについてのポッドキャスト でもなぜか消えちゃったんですよ
        [00:14.600 -> 00:21.780] 音楽も入れて公開するだけだったんですけど すごいショックです
        [00:22.780 -> 00:25.560] なのでもう一度撮ります。
        [00:29.160 -> 00:30.220] ということで、オノマトペについてお話しします。
        [00:33.420 -> 00:34.500] オノマトペは簡単なルールがあります。
        [00:37.560 -> 00:38.020] これを覚えると、オノマトペを聞いて、
        [00:41.600 -> 00:44.200] どんな意味なのかイメージするのが簡単になります。       
        [00:50.740 -> 00:56.080] オノマトペはたくさんあって大変だし 翻訳機ではなかなか訳せないからちょっと難しいんですが だからこそオノマトペを使えるようになると       
        [00:56.080 -> 01:08.780] いろんな表現をすることができてとっても 楽しいのでぜひ楽しく練習してみてください。じゃあ今日は、なぜ日本語にはオノマトペが多いのか、    
        [01:09.620 -> 01:16.300] それからオノマトペの歴史、そして覚えやすいですよ、簡単 なオノマトペのルール、
        [01:17.420 -> 01:21.180] 最後にオノマトペの練習方法をお話しします。
        [01:22.760 -> 01:32.280] じゃあまず、なぜ日本語にはオノマトペがたくさんあるのか というと、動詞が少ないからというのが一つの理由です。
        [01:33.700 -> 01:38.520] 例えば、英語だと動詞自体にいろいろな意味があります。   
        [01:39.520 -> 01:49.340] 笑う。英語だとスマイルとかラフとかで、どのように笑って いるかを表現することができますよね。
        [01:50.440 -> 01:53.760] でも日本語だと笑うだけなんです。
        [01:55.360 -> 02:01.540] なのでそこにオノマトペをつけて、どんなふうに笑っている かを表現します。
        [02:01.580 -> 02:02.300] どのように笑っているかを表現します。
        [02:08.340 -> 02:09.220] 例えば、にっこり笑う、げらげら笑う、けたけた笑うとか、 
        [02:14.860 -> 02:16.360] こうやってオノマトペをつけて、どのように笑っているのか を表現します。
        [02:17.520 -> 02:18.540] 光るもそうですね。
        [02:26.100 -> 02:26.660] 英語だったら、シャインとかフラッシュなどで、この動詞で 違いを表現することができますよね。
        [02:29.680 -> 02:30.720] でも日本語だと光るだけです。
        [02:38.780 -> 02:39.840] なのでキラキラ光るとかピカピカ光るとかこのようにオノマ トペをつけます。
        [02:40.860 -> 02:41.540] 便利ですよね。
        [02:44.200 -> 02:46.540] こうやっていろんな表現ができます。
        [02:51.120 -> 02:52.180] これはすごく感覚的な音なので、どんどん増えていきます。 
        [02:59.400 -> 03:04.160] 例えばちょっと昔ですが、電子レンジで温めるという言葉に オノマトペができたんですよ。電子レンジでチンする。このチンするがオノマトペですね。
        [03:07.380 -> 03:18.380] レンジでチンするこのチンするがオノマトペですね チンはあの電子レンジが温めるのが終わった後にねチンって教えてくれるんですけどその音をつけました あとは最近だったら
        [03:18.380 -> 03:22.360] 若い子が作ったピエンと 泣いてる顔
        [03:22.360 -> 03:23.680] ピエンと泣いてる顔。
        [03:27.800 -> 03:28.560] このように日本語は聞こえる音を言葉にしたり、
        [03:33.320 -> 03:34.800] 音がないものに言葉をつけていろいろな表現をするんですね 。
        [03:37.960 -> 03:38.660] で、これ最近始まったわけではなくて、
        [03:43.780 -> 03:45.120] なんと1300年前にすでに使っていたらしいんですね。       
        [03:48.180 -> 03:49.880] ということでオノマトペの歴史に行きましょう。
        [03:55.200 -> 03:56.380] 日本で一番古い本とされている古事記という歴史書がありま す。
        [04:04.280 -> 04:12.860] この本は日本という国がどうやって生まれたかという物語か ら始まる本なんですが、そこにコウロコウロとかき混ぜて国を作ったという表現が出てくるんですよ。
        [04:13.740 -> 04:23.400] このコウロコウロは、今でいうとね、ぐるぐるかき混ぜて作 ったというイメージだったと思われてますね。
        [04:25.400 -> 04:29.200] はい、ではここからはオノマトペのルールです。
        [04:29.780 -> 04:32.580] これを知るともっとね、身近になると思います。
        [04:33.780 -> 04:39.240] まず、ひらがなには一つ一つイメージ、印象があります。   
        [04:40.320 -> 04:42.800] 例えば、アイウエオのア。
        [04:43.780 -> 04:48.740] アの音は開く、広がるというイメージがあります
        [04:48.740 -> 04:52.180] アーは口を開けて発音しますよね
        [04:52.180 -> 04:59.060] 例えば今日はカラッとして気持ちいい天気だねという言葉   
        [04:59.060 -> 05:00.560] このカラッと
        [05:00.560 -> 05:10.240] この言葉はね乾燥している様子とか空が明るい広い爽やかと いう意味があります。
        [05:11.520 -> 05:16.180] そしてかもらも母音はあーですよね。
        [05:17.640 -> 05:24.540] なのでカラッとしていて気持ちいいねこれは気持ちよさが広 がる。
        [05:24.520 -> 05:25.140] 気持ちいいねー、これは気持ちよさが広がる。
        [05:30.160 -> 05:32.200] 両手を広げて、あー気持ちいいと感じているイメージがある んです。
        [05:40.820 -> 05:42.080] じゃあ、例えば湿度が高い、そしてジメジメしてるねーとい うとき、このジメジメですね。
        [05:47.640 -> 05:48.600] まず、じーという言葉に動かないという意味があります。   
        [05:55.220 -> 06:06.800] じっと考えるとか、じっと見るとか、そういう動かないとい う意味があるので、じめじめするねーはこの湿度、水分が体について動かない、深い、こういうイメージがあります。
        [06:08.180 -> 06:12.900] じゃあ今度は、じじゃなくて、し、さしすせそのし。       
        [06:14.240 -> 06:18.440] しは、静かにしてっていう時に、しってやりますよね。     
        [06:19.220 -> 06:21.600] なので、静かなイメージです。
        [06:22.700 -> 06:25.560] 例えば、雪がしんしんと降る。
        [06:26.340 -> 06:27.900] このしんしんと降る。
        [06:28.460 -> 06:31.560] 雪が静かに降るという意味があります。
        [06:32.780 -> 06:36.580] あとは、教室に誰もいなくてしーんとしている。
        [06:38.120 -> 06:41.940] このしーんはとても静かな様子を表します。
        [06:43.400 -> 06:47.020] こういう感じで、ひらがなのイメージを知ると
        [06:47.020 -> 06:49.840] ちょっとオノマトペが面白くなりますよね
        [06:49.840 -> 06:54.020] もう一つルールがあります
        [06:54.020 -> 06:57.760] 声音と濁音の違いです
        [06:57.760 -> 07:00.920] 点々があるかないかですね
        [07:00.920 -> 07:05.040] 例えばかないかですね例えばさしすせそはせいおん
        [07:05.040 -> 07:08.000] ざじずぜぞはだくおん
        [07:08.580 -> 07:09.900] かきくげこは
        [07:09.900 -> 07:11.180] せいおん
        [07:11.180 -> 07:13.180] がぎぐげこはだくおんです
        [07:13.180 -> 07:15.420] でせいおんは
        [07:15.420 -> 07:17.940] ちいさいとかかるい
        [07:17.940 -> 07:19.900] あかるいこういう
        [07:19.900 -> 07:20.960] いんしょうがあって
        [07:20.960 -> 07:23.800] だくおんはおおきい
        [07:23.800 -> 07:27.240] おもいくらいこういういう印象があります。
        [07:28.220 -> 07:32.260] なので、例えば、石がコロコロ転がるだと、
        [07:32.820 -> 07:37.180] 小さい石が転がる様子を想像することができます。
        [07:38.100 -> 07:44.260] 反対に、ゴロゴロ転がるだと、大きい石、岩かな、
        [07:44.820 -> 07:52.360] ちょっと重そうだなと想像することができます 他にもありますよ例えば雨
        [07:52.360 -> 08:00.240] 雨がサーサー降っている雨がザーザー降っている これも静音と濁音の違いですね
        [08:00.240 -> 08:07.180] サーサーよりザーザーの方が強い雨なんだなぁと想像するこ とができます
        [08:07.180 -> 08:15.400] このようにひらがなのイメージそれから静音濁音のイメージ を知っておくと
        [08:15.400 -> 08:18.680] オノマトペの印象わかりやすくなってきますよね
        [08:18.680 -> 08:25.980] では最後にオノマトペの練習方法を紹介して終わりにします 
        [08:25.980 -> 08:30.360] いい練習はですね絵本をたくさん見ることです
        [08:31.580 -> 08:36.000] 日本人は小さい頃からたくさんのオノマトペを聞いて育ちま す
        [08:36.000 -> 08:42.100] 絵本だと絵と一緒にオノマトペが書いてあってとてもわかり やすいです
        [08:42.100 -> 08:45.540] はいオノマトペはね最初は
        [08:45.540 -> 08:47.580] わかりにくいかもしれないんですが
        [08:47.580 -> 08:49.860] 覚えるととっても便利です
        [08:49.860 -> 08:52.620] 表現の幅も広がるし
        [08:52.620 -> 08:54.160] 翻訳機では
        [08:54.160 -> 08:56.140] なかなか出てこない表現が
        [08:56.140 -> 08:57.320] できるようになるので
        [08:57.320 -> 09:00.200] ぜひ楽しく練習してみてください
        [09:00.200 -> 09:01.560] では
        [09:01.560 -> 09:02.600] バイバイ
        [09:03.990 -> 09:06.590] ではバイバイ
    '''
    
    lines = string.strip().split('\n')
    text = "\n".join([line[line.index(']')+2:] for line in lines])
    durations = [(int(line[line.index('[')+1:line.index('[')+3])*60+float(line[line.index('[')+4:line.index('[')+10]), 
                  int(line[line.index(']')-9:line.index(']')-7])*60+float(line[line.index(']')-6:line.index(']')])) 
                  for line in lines]
    
    result = []
    for x in list(zip(durations, text.split('\n'))):
        result.append({"start":x[0][0], "end":round(x[0][1], 2), "line":x[1]})
    return result
    